In [1]:
# Imports
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [5]:
df = pd.read_csv('CSR1333 SOC Marr film character analysis data export from Tableau 20200122.csv')

In [6]:
df.head()

,1. Character/Person (Sheet11),1. Character/Person 1 (Sheet11),1. Character/Person 1,1. Character/Person,10. Education (Sheet11),10. Education 1 (Sheet11),10. Education 1,10. Education,10. Was the education level explicitly mentioned? (Sheet11),10. Was the education level explicitly mentioned? 1 (Sheet11),...,rank cat (Sheet11),Rank Cat,rating (Sheet11),Rating,sex (Sheet11),Sex,weight (Sheet11),weight2 (Sheet11),Weight2,Weight
0,Eilis,Eilis,Eilis,Eilis,College,College,3.0,3.0,No,Yes,...,101 or higher,5,PG-13,2,female,2,average,2.0,2.0,4.0
1,Tony,Tony,Tony,Tony,High school degree,High school degree,2.0,2.0,No,No,...,101 or higher,5,PG-13,2,male,1,average,2.0,2.0,4.0
2,Bucky Barnes,NaN,NaN,Bucky Barnes,College,NaN,NaN,3.0,No,NaN,...,25-Jan,1,PG-13,2,male,1,average,2.0,2.0,4.0
3,Iron Man,Tony Stark,Tony Stark,Iron Man,Graduate school +,Graduate school +,4.0,4.0,NaN,No,...,25-Jan,1,PG-13,2,male,1,average,2.0,2.0,4.0
4,Natasha Romanoff,NaN,NaN,Natasha Romanoff,College,NaN,NaN,3.0,No,NaN,...,25-Jan,1,PG-13,2,female,2,average,2.0,2.0,4.0

In [14]:
len(df['Movie'].unique())

98

In [23]:
len(df['Movie'])

427

In [27]:
df[['6. Age (Sheet11)', '6. Age 1 (Sheet11)', '6. Age 1', '6. Age']]

         6. Age (Sheet11)    6. Age 1 (Sheet11)  6. Age 1  6. Age
0      Middle Age (40-54)    Middle Age (40-54)       6.0       6
1      Middle Age (40-54)    Middle Age (40-54)       6.0       6
2      Early teen (13-15)                   NaN       NaN       7
3    Mature Adult (55-64)  Mature Adult (55-64)       8.0       8
4      Early teen (13-15)                   NaN       NaN       7
..                    ...                   ...       ...     ...
422    Early teen (13-15)    Early teen (13-15)       7.0       7
423  Mature Adult (55-64)  Mature Adult (55-64)       8.0       8
424  Mature Adult (55-64)  Mature Adult (55-64)       8.0       8
425  Mature Adult (55-64)  Mature Adult (55-64)       8.0       8
426    Early teen (13-15)  Mature Adult (55-64)       8.0       7

[427 rows x 4 columns]

In [31]:
df['4. Sex (Sheet11)'].unique()

array(['Female', 'Male', 'Unsure'], dtype=object)

In [32]:
len(df[df['4. Sex (Sheet11)']== 'Unsure'])

1

In [37]:
df_attr = df[['4. Sex (Sheet11)', '6. Age (Sheet11)','attractiveness (Sheet11)']]

In [47]:
df_attr = df_attr.rename(columns= {'4. Sex (Sheet11)': 'sex', '6. Age (Sheet11)': 'age', 'attractiveness (Sheet11)': 'attractiveness' })

In [53]:
df_male = df_attr[df_attr['sex']== 'Male']
df_male.head()

    sex                   age      attractiveness
1  Male    Middle Age (40-54)             average
2  Male    Early teen (13-15)             average
3  Male  Mature Adult (55-64)          attractive
5  Male    Early teen (13-15)  average/attractive
7  Male    Early teen (13-15)          attractive

In [54]:
df_female = df_attr[df_attr['sex']== 'Female']
df_female.head()

       sex                   age attractiveness
0   Female    Middle Age (40-54)     attractive
4   Female    Early teen (13-15)     attractive
6   Female  Mature Adult (55-64)        average
9   Female    Early teen (13-15)     attractive
11  Female    Early teen (13-15)     attractive

In [77]:
df_mVF_final = pd.DataFrame(columns=['sex','counts attractive', 'counts medium', 'counts average'])
counts_attrM= len(df_male[df_male['attractiveness'] == 'attractive'])
counts_avgM= len(df_male[df_male['attractiveness'] == 'average'])
counts_medM= len(df_male[df_male['attractiveness'] == 'average/attractive'])

counts_attrF= len(df_female[df_female['attractiveness'] == 'attractive'])
counts_avgF= len(df_female[df_female['attractiveness'] == 'average'])
counts_medF= len(df_female[df_female['attractiveness'] == 'average/attractive'])

In [78]:
df_mVF_final = df_mVF_final.append({ 'sex': "Male", 'counts attractive': counts_attrM, 'counts medium': 
                                   counts_medM, 'counts average': counts_avgM}, ignore_index=True)
df_mVF_final = df_mVF_final.append({ 'sex': "Female", 'counts attractive': counts_attrF, 'counts medium': 
                                   counts_medF, 'counts average': counts_avgF}, ignore_index=True)

df_mVF_final.head()

      sex counts attractive counts medium counts average
0    Male                60            35            146
1  Female                83            23             59